app/views/produtos/_formbusca.html.erb

SELECT "categorias".* FROM "categorias"
---

		<%= select_tag :pcategoria, options_for_select(Categoria.all.map{ |p| [p.descricao, p.id] }.insert(0, ""),selected:@pcategoria)%>