app/views/produtos/_form.html.erb

SELECT "categorias".* FROM "categorias"
---
    <%= f.label :categoria_id %>
    <%= f.select :categoria_id, options_for_select(Categoria.all.map{|m|[m.descricao,m.id]},f.object.categoria_id) %>