app/controllers/categorias_controller.rb

  def index

     # buscar a categoria
    @pdescricao = params[:pdescricao]
    filtro = "1=1"
    if not(@pdescricao.nil?)
       filtro = filtro + " and descricao like '%"+@pdescricao+"%'"
    end
#   @funcionarios = Funcionario.where(filtro).order("nome")
    @categorias = Categoria.where(filtro).paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "categorias" WHERE (1=1 and descricao like '%cerveja%')

  def create
    @categoria = Categoria.new(categoria_params)

    respond_to do |format|
      if @categoria.save
---
INSERT INTO "categorias" ("descricao", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descricao", "Tequila"], ["created_at", 2016-10-03 15:00:02 UTC], ["updated_at", 2016-10-03 15:00:02 UTC]]

    def set_categoria
      @categoria = Categoria.find(params[:id])
---
SELECT  "categorias".* FROM "categorias" WHERE (1=1 and descricao like '%cerveja%') LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]