app/controllers/paginas_controller.rb

SELECT "produtos".* FROM "produtos"
---
  def bebidas
  	@produtos = Produto.all