app/controllers/pedidos_controller.rb

SELECT "pedidos".* FROM "pedidos"
---
  def index
    @pedidos = Pedido.all