app/controllers/produtoslistagem_controller.rb

SELECT  "produtos".* FROM "produtos" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    #if current_user.tipo == 'Administrador'
    #  @atividades = Atividade.all.order("aluno_id,created_at DESC").paginate(page: params[:page], per_page: 10)
    #else
     # if current_user.tipo == 'Aluno'
      #  @atividades = Atividade.where(aluno_id: current_user.id).order("aluno_id, created_at DESC").paginate(page: params[:page], per_page: 10)
      #else
       # @atividades = Atividade.where(julgador_id: current_user.id).order("aluno_id, created_at DESC").paginate(page: params[:page], per_page: 10)
      #end
    #end
    @produtos = Produto.all.paginate(page: params[:page], per_page: 10)