app/controllers/produtos_controller.rb

  def index
    # buscar o sexo
    @pdescricao = params[:pdescricao]
    # buscar o nome
    @pcategoria = params[:pcategoria]
    filtro = "1=1"




    if not(@pdescricao.nil?)
       filtro = filtro + " and descricao like '%"+@pdescricao+"%'"
    end

    if (not(@pcategoria.blank?))
       filtro = filtro + " and categoria_id =" + @pcategoria

    end


#   @funcionarios = Funcionario.where(filtro).order("nome")
    @produtos = Produto.where(filtro).paginate(page: params[:page], per_page: 5)
---
SELECT "categorias".* FROM "categorias"
SELECT  "produtos".* FROM "produtos" WHERE (1=1 and descricao like '%%' and categoria_id like '%2%') LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "produtos" WHERE (1=1 and descricao like '%%' and categoria_id like '%1%')

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("descricao", "volume", "valorunit", "created_at", "updated_at", "categoria_id", "img") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["descricao", "Jose Cuervo"], ["volume", 1.0], ["valorunit", 150.0], ["created_at", 2016-10-03 15:00:41 UTC], ["updated_at", 2016-10-03 15:00:41 UTC], ["categoria_id", 1], ["img", "tequila.jpeg"]]

  def update
    respond_to do |format|
      if @produto.update(produto_params)
---
UPDATE "produtos" SET "descricao" = ?, "volume" = ?, "valorunit" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["descricao", "Antartica"], ["volume", 300.0], ["valorunit", 5.0], ["updated_at", 2016-09-29 22:30:45 UTC], ["id", 1]]

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT  "produtos".* FROM "produtos" WHERE (1=1 and categoria_id = 'V'  and descricao like '%%') LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]